# Beginner's Guide to using pandas

In [1]:
#import the necessary libraries
import pandas as pd

## We will begin by downloading a sample dataset

In [26]:
#use the pd.read_csv to get our file uploaded
df = pd.read_csv('toy_dataset.csv')

In [27]:
df.Number = df.Number -1

In [29]:
df.rename(columns={'Number':'index'}, inplace=True)
df.set_index('index', inplace=True)
df.head()

         City Gender  Age   Income Illness
index
0      Dallas   Male   41  40367.0      No
1      Dallas   Male   54  45084.0      No
2      Dallas   Male   42  52483.0      No
3      Dallas   Male   40  40941.0      No
4      Dallas   Male   46  50289.0      No

In [38]:
df['City']=='Dallas'

index
0          True
1          True
2          True
3          True
4          True
          ...
149995    False
149996    False
149997    False
149998    False
149999    False
Name: City, Length: 150000, dtype: bool

In [35]:
df['City']

index
0         Dallas
1         Dallas
2         Dallas
3         Dallas
4         Dallas
           ...
149995    Austin
149996    Austin
149997    Austin
149998    Austin
149999    Austin
Name: City, Length: 150000, dtype: object

In [36]:
df[['City','Age']]

          City  Age
index
0       Dallas   41
1       Dallas   54
2       Dallas   42
3       Dallas   40
4       Dallas   46
...        ...  ...
149995  Austin   48
149996  Austin   25
149997  Austin   26
149998  Austin   25
149999  Austin   37

[150000 rows x 2 columns]

In [39]:
df[df['City']=='Dallas']

         City  Gender  Age   Income Illness
index
0      Dallas    Male   41  40367.0      No
1      Dallas    Male   54  45084.0      No
2      Dallas    Male   42  52483.0      No
3      Dallas    Male   40  40941.0      No
4      Dallas    Male   46  50289.0      No
...       ...     ...  ...      ...     ...
19702  Dallas  Female   59  30021.0      No
19703  Dallas    Male   33  34643.0      No
19704  Dallas    Male   33  53190.0      No
19705  Dallas    Male   37  54265.0      No
19706  Dallas    Male   59  51265.0      No

[19707 rows x 5 columns]

In [40]:
df[df['Age']>=45]    #you can also use other comparisons

          City  Gender  Age   Income Illness
index
1       Dallas    Male   54  45084.0      No
4       Dallas    Male   46  50289.0      No
8       Dallas    Male   51  68667.0      No
10      Dallas  Female   48  41524.0     Yes
11      Dallas    Male   47  54777.0      No
...        ...     ...  ...      ...     ...
149987  Austin  Female   55  62501.0      No
149989  Austin    Male   52  83688.0      No
149991  Austin    Male   51  97510.0      No
149993  Austin    Male   64  89906.0      No
149995  Austin    Male   48  93669.0      No

[76479 rows x 5 columns]